--------------------------------------------
## These changes are about to be deployed!!!
--------------------------------------------
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.api.aws_api_gateway_api_key.api-key will be created
  + resource "aws_api_gateway_api_key" "api-key" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = "Customers usage control"
      + enabled           = true
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "x-api-key"
      + tags_all          = (known after apply)
      + value             = (sensitive value)
    }

  # module.api.aws_api_gateway_authorizer.oauth will be created
  + resource "aws_api_gateway_authorizer" "oauth" {
      + arn                              = (known after apply)
      + authorizer_result_ttl_in_seconds = 300
      + id                               = (known after apply)
      + identity_source                  = "method.request.header.x-auth-token"
      + name                             = "mdata"
      + provider_arns                    = (known after apply)
      + rest_api_id                      = (known after apply)
      + type                             = "COGNITO_USER_POOLS"
    }

  # module.api.aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = (known after apply)
    }

  # module.api.aws_api_gateway_integration.iptv-integration will be created
  + resource "aws_api_gateway_integration" "iptv-integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + credentials             = "arn:aws:iam::219099686986:role/apiGatewayUseSageMakerEndpoints"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = "WHEN_NO_MATCH"
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:apigateway:eu-west-1:runtime.sagemaker:path/endpoints/linear-single/invocations"
    }

  # module.api.aws_api_gateway_integration_response.integration-response will be created
  + resource "aws_api_gateway_integration_response" "integration-response" {
      + http_method = "POST"
      + id          = (known after apply)
      + resource_id = (known after apply)
      + rest_api_id = (known after apply)
      + status_code = "200"
    }

  # module.api.aws_api_gateway_method.iptv-method will be created
  + resource "aws_api_gateway_method" "iptv-method" {
      + api_key_required     = true
      + authorization        = "COGNITO_USER_POOLS"
      + authorization_scopes = [
          + "mdata-resource/testing.read",
        ]
      + authorizer_id        = (known after apply)
      + http_method          = "POST"
      + id                   = (known after apply)
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
    }

  # module.api.aws_api_gateway_method_response.response_200 will be created
  + resource "aws_api_gateway_method_response" "response_200" {
      + http_method = "POST"
      + id          = (known after apply)
      + resource_id = (known after apply)
      + rest_api_id = (known after apply)
      + status_code = "200"
    }

  # module.api.aws_api_gateway_resource.iptv-resource will be created
  + resource "aws_api_gateway_resource" "iptv-resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "iptv"
      + rest_api_id = (known after apply)
    }

  # module.api.aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "API created from terraform"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "mdata"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.api.aws_api_gateway_stage.stage-test will be created
  + resource "aws_api_gateway_stage" "stage-test" {
      + arn                   = (known after apply)
      + cache_cluster_enabled = true
      + cache_cluster_size    = "0.5"
      + deployment_id         = (known after apply)
      + execution_arn         = (known after apply)
      + id                    = (known after apply)
      + invoke_url            = (known after apply)
      + rest_api_id           = (known after apply)
      + stage_name            = "testing"
      + tags_all              = (known after apply)
      + web_acl_arn           = (known after apply)
    }

  # module.api.aws_api_gateway_usage_plan.usage-plan will be created
  + resource "aws_api_gateway_usage_plan" "usage-plan" {
      + arn         = (known after apply)
      + description = "Custom usage plan"
      + id          = (known after apply)
      + name        = "custom-plan"
      + tags_all    = (known after apply)

      + api_stages {
          + api_id = (known after apply)
          + stage  = "testing"
        }

      + quota_settings {
          + limit  = 200
          + offset = 2
          + period = "WEEK"
        }

      + throttle_settings {
          + burst_limit = 5
          + rate_limit  = 10
        }
    }

  # module.api.aws_api_gateway_usage_plan_key.plan-key will be created
  + resource "aws_api_gateway_usage_plan_key" "plan-key" {
      + id            = (known after apply)
      + key_id        = (known after apply)
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = (known after apply)
      + value         = (known after apply)
    }

  # module.auth.aws_cognito_resource_server.resource_server will be created
  + resource "aws_cognito_resource_server" "resource_server" {
      + id                = (known after apply)
      + identifier        = "mdata-resource"
      + name              = "mdata-resource"
      + scope_identifiers = (known after apply)
      + user_pool_id      = (known after apply)

      + scope {
          + scope_description = "Read acces for 'testing' stage resources"
          + scope_name        = "testing.read"
        }
    }

  # module.auth.aws_cognito_user_pool.pool will be created
  + resource "aws_cognito_user_pool" "pool" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "mdata-user-pool"
      + sms_verification_message   = (known after apply)
      + tags_all                   = (known after apply)

      + admin_create_user_config {
          + allow_admin_create_user_only = (known after apply)

          + invite_message_template {
              + email_message = (known after apply)
              + email_subject = (known after apply)
              + sms_message   = (known after apply)
            }
        }

      + password_policy {
          + minimum_length                   = (known after apply)
          + require_lowercase                = (known after apply)
          + require_numbers                  = (known after apply)
          + require_symbols                  = (known after apply)
          + require_uppercase                = (known after apply)
          + temporary_password_validity_days = (known after apply)
        }

      + sms_configuration {
          + external_id    = (known after apply)
          + sns_caller_arn = (known after apply)
        }

      + verification_message_template {
          + default_email_option  = (known after apply)
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # module.auth.aws_cognito_user_pool_client.client will be created
  + resource "aws_cognito_user_pool_client" "client" {
      + access_token_validity                = 10
      + allowed_oauth_flows                  = [
          + "client_credentials",
        ]
      + allowed_oauth_flows_user_pool_client = true
      + allowed_oauth_scopes                 = [
          + "mdata-resource/testing.read",
        ]
      + callback_urls                        = (known after apply)
      + client_secret                        = (sensitive value)
      + enable_token_revocation              = true
      + explicit_auth_flows                  = [
          + "ALLOW_CUSTOM_AUTH",
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_SRP_AUTH",
        ]
      + generate_secret                      = true
      + id                                   = (known after apply)
      + id_token_validity                    = 10
      + logout_urls                          = (known after apply)
      + name                                 = "mdata-client"
      + prevent_user_existence_errors        = "ENABLED"
      + refresh_token_validity               = 5
      + user_pool_id                         = (known after apply)

      + token_validity_units {
          + access_token  = "minutes"
          + id_token      = "minutes"
          + refresh_token = "days"
        }
    }

  # module.auth.aws_cognito_user_pool_domain.domain will be created
  + resource "aws_cognito_user_pool_domain" "domain" {
      + aws_account_id              = (known after apply)
      + cloudfront_distribution_arn = (known after apply)
      + domain                      = "mdata-domain"
      + id                          = (known after apply)
      + s3_bucket                   = (known after apply)
      + user_pool_id                = (known after apply)
      + version                     = (known after apply)
    }

  # module.roles.aws_iam_role.role_api_sagemaker will be created
  + resource "aws_iam_role" "role_api_sagemaker" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "apiGatewayUseSageMakerEndpoints"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "allow_sagemaker_endpoints"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "sagemaker:InvokeEndpoint",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:sagemaker:eu-west-1:219099686986:endpoint/*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```